Repository: YuraFilionchik/TelegramWordBot
Catalog: Resources/SharedResource.*.resx
Languages: de, et, fr, pl, ru, tr, zh_cn

# MyWordsMenu.MyWords
source: 📚 My words
de: 📚 Meine Wörter
et: 📚 Minu sõnad
fr: 📚 Mes mots
pl: 📚 Moje słowa
ru: 📚 Мои слова
tr: 📚 Kelimelerim
zh_cn: 📚 我的单词

# MyWordsMenu.ShowAllWords
source: 🔍 Show all words
de: 🔍 Alle Wörter anzeigen
et: 🔍 Kuva kõik sõnad
fr: 🔍 Afficher tous les mots
pl: 🔍 Pokaż wszystkie słowa
ru: 🔍 Показать все слова
tr: 🔍 Tüm kelimeleri göster
zh_cn: 🔍 显示所有单词

# MyWordsMenu.DictionariesByTopics
source: 📁 Dictionaries by topics
de: 📁 Wörterbücher nach Themen
et: 📁 Sõnastikud teemade kaupa
fr: 📁 Dictionnaires par thèmes
pl: 📁 Słowniki według tematu
ru: 📁 Словари по темам
tr: 📁 Konulara göre sözlükler
zh_cn: 📁 按主题分类的词典

# MyWordsMenu.EditWord
source: 📝 Edit word
de: 📝 Wort bearbeiten
et: 📝 Muuda sõna
fr: 📝 Modifier le mot
pl: 📝 Edytuj słowo
ru: 📝 Изменить слово
tr: 📝 Kelimeyi düzenle
zh_cn: 📝 编辑单词

# MyWordsMenu.DeleteWords
source: 🗑️ Delete words
de: 🗑️ Wörter löschen
et: 🗑️ Kustuta sõnad
fr: 🗑️ Supprimer les mots
pl: 🗑️ Usuń słowa
ru: 🗑️ Удалить слова
tr: 🗑️ Kelimeleri sil
zh_cn: 🗑️ 删除单词

# MyWordsMenu.Back
source: ⬅️ Back
de: ⬅️ Zurück
et: ⬅️ Tagasi
fr: ⬅️ Retour
pl: ⬅️ Wstecz
ru: ⬅️ Назад
tr: ⬅️ Geri
zh_cn: ⬅️ 返回

# MainMenu.AddWord
source: ➕ Add word
de: ➕ Wort hinzufügen
et: ➕ Lisa sõna
fr: ➕ Ajouter un mot
pl: ➕ Dodaj słowo
ru: ➕ Добавить слово
tr: ➕ Kelime ekle
zh_cn: ➕ 添加单词

# MainMenu.Learn
source: 📖 Learn
de: 📖 Lernen
et: 📖 Õpi
fr: 📖 Apprendre
pl: 📖 Ucz się
ru: 📖 Учить
tr: 📖 Öğren
zh_cn: 📖 学习

# MainMenu.Settings
source: 🌐 Settings
de: 🌐 Einstellungen
et: 🌐 Seaded
fr: 🌐 Paramètres
pl: 🌐 Ustawienia
ru: 🌐 Настройки
tr: 🌐 Ayarlar
zh_cn: 🌐 设置

# MainMenu.Statistics
source: 📊 Statistics
de: 📊 Statistik
et: 📊 Statistika
fr: 📊 Statistiques
pl: 📊 Statystyki
ru: 📊 Статистика
tr: 📊 İstatistikler
zh_cn: 📊 统计

# MainMenu.Profile
source: 👤 Profile
de: 👤 Profil
et: 👤 Profiil
fr: 👤 Profil
pl: 👤 Profil
ru: 👤 Профиль
tr: 👤 Profil
zh_cn: 👤 个人资料

# MainMenu.GenerateNewWords
source: Generate new words
de: Neue Wörter generieren
et: Genereeri uusi sõnu
fr: Générer de nouveaux mots
pl: Generuj nowe słowa
ru: Генерация новых слов
tr: Yeni kelimeler üret
zh_cn: 生成新词

# Worker.EnterWordForEditing
source: Enter a word or part of it:
de: Geben Sie ein Wort oder einen Teil davon ein:
et: Sisestage sõna või selle osa:
fr: Entrez un mot ou une partie de celui-ci :
pl: Wpisz słowo lub jego część:
ru: Введите слово или его часть:
tr: Düzenlenecek kelimeyi veya bir kısmını girin:
zh_cn: 输入要编辑的单词或其部分:

# Worker.EnterWordToAdd
source: Enter a word to add:
de: Geben Sie ein Wort zum Hinzufügen ein:
et: Sisestage lisatav sõna:
fr: Entrez un mot à ajouter :
pl: Wpisz słowo do dodania:
ru: Введите слово для добавления:
tr: Eklenecek bir kelime girin:
zh_cn: 输入要添加的单词:

# Worker.EnterThemeForWordGeneration
source: What topic to add words for?:
de: Zu welchem Thema sollen Wörter hinzugefügt werden?:
et: Millisele teemale sõnu lisada?:
fr: Sur quel sujet ajouter des mots ?
pl: Na jaki temat dodać słowa?:
ru: На какую тему добавить слова?:
tr: Hangi konuya kelime eklemeli?:
zh_cn: 要为哪个主题添加单词?:

# Worker.WordDeleted
source: Word '{0}' deleted
de: Wort „{0}“ gelöscht
et: Sõna „{0}“ kustutatud
fr: Mot „{0}“ supprimé
pl: Słowo '{0}' usunięte
ru: Слово '{0}' удалено
tr: „{0}“ kelimesi silindi
zh_cn: 单词“{0}”已删除

# Worker.WordNotFound
source: Word '{0}' not found
de: Wort „{0}“ nicht gefunden
et: Sõna „{0}“ ei leitud
fr: Mot „{0}“ introuvable
pl: Słowo '{0}' nie znalezione
ru: Слово '{0}' не найдено
tr: „{0}“ kelimesi bulunamadı
zh_cn: 未找到单词“{0}”

# Worker.WordAddedToFavorites
source: Word '{0}' added to favorites
de: Wort „{0}“ zu Favoriten hinzugefügt
et: Sõna „{0}“ lisatud lemmikutesse
fr: Mot „{0}“ ajouté aux favoris
pl: Słowo '{0}' dodane do ulubionych
ru: Слово '{0}' добавлено в избранное
tr: „{0}“ kelimesi favorilere eklendi
zh_cn: 单词“{0}”已添加到收藏夹

# Worker.EnterNativeLanguage
source: Enter your native language:
de: Geben Sie Ihre Muttersprache ein:
et: Sisestage oma emakeel:
fr: Entrez votre langue maternelle :
pl: Wpisz swój język ojczysty:
ru: Введите ваш родной язык:
tr: Ana dilinizi girin:
zh_cn: 输入您的母语:

# Worker.EnterLanguageToLearn
source: Enter the name of the language to learn:
de: Geben Sie den Namen der zu lernenden Sprache ein:
et: Sisestage õpitava keele nimi:
fr: Entrez le nom de la langue à apprendre :
pl: Wpisz nazwę języka do nauki:
ru: Введите название языка для изучения:
tr: Öğrenmek istediğiniz dilin adını girin:
zh_cn: 输入要学习的语言名称:

# Worker.NoAddedLanguages
source: You have no added languages.
de: Sie haben keine Sprachen hinzugefügt.
et: Teil pole lisatud keeli.
fr: Vous n'avez pas de langues ajoutées.
pl: Nie masz dodanych języków.
ru: У вас нет добавленных языков.
tr: Eklenmiş diliniz yok.
zh_cn: 您没有添加任何语言。

# Worker.YourLanguages
source: Your languages: {0} Enter code to delete:
de: Ihre Sprachen:\n{0}\nGeben Sie den zu löschenden Code ein:
et: Teie keeled:\n{0}\nSisestage kustutatav kood:
fr: Vos langues : {0} Entrez le code à supprimer :
pl: Twoje języki: {0} Wpisz kod do usunięcia:
ru: Ваши языки:{0}Введите код для удаления:
tr: Dilleriniz:\n{0}\nSilmek için kodu girin:
zh_cn: 您的语言:{0}输入要删除的代码:

# Worker.ResetStatisticsConfirmation
source: Reset statistics?
de: Statistiken zurücksetzen?
et: Lähtesta statistika?
fr: Réinitialiser les statistiques ?
pl: Zresetować statystyki?
ru: Сбросить статистику?
tr: İstatistikleri sıfırla?
zh_cn: 重置统计数据?

# Worker.EnterNewDictionaryName
source: Enter the name of the new dictionary:
de: Geben Sie den Namen des neuen Wörterbuchs ein:
et: Sisestage uue sõnastiku nimi:
fr: Entrez le nom du nouveau dictionnaire :
pl: Podaj nazwę nowego słownika:
ru: Введите название нового словаря:
tr: Yeni sözlüğün adını girin:
zh_cn: 输入新词典的名称:

# Worker.AutoFillDictionaryCancelled
source: Dictionary autofill cancelled.
de: Wörterbuch-Autovervollständigung abgebrochen.
et: Sõnastiku automaatne täitmine tühistati.
fr: Remplissage automatique du dictionnaire annulé.
pl: Autouzupełnianie słownika anulowane.
ru: Автозаполнение словаря отменено.
tr: Sözlük otomatik doldurma iptal edildi.
zh_cn: 词典自动填充已取消。

# Worker.FailedToGetWordsForTheme
source: Failed to get words for the topic.
de: Es konnten keine Wörter für das Thema abgerufen werden.
et: Sõnu ei õnnestunud teema kohta hankida.
fr: Impossible d'obtenir des mots pour le sujet.
pl: Nie udało się pobrać słów dla tematu.
ru: Не удалось получить слова по теме.
tr: Konu için kelimeler alınamadı.
zh_cn: 无法获取该主题的单词。

# Worker.DictionaryAutoFillSuccess
source: Dictionary '{0}' autofill completed successfully.
de: Wörterbuch „{0}“ erfolgreich automatisch ausgefüllt.
et: Sõnastiku „{0}“ automaatne täitmine edukalt lõpetatud.
fr: Remplissage automatique du dictionnaire „{0}“ terminé avec succès.
pl: Autouzupełnianie słownika '{0}' zakończone pomyślnie.
ru: Автозаполнение словаря '{0}' успешно завершено.
tr: „{0}“ sözlüğü otomatik doldurma başarıyla tamamlandı.
zh_cn: 词典“{0}”自动填充成功完成。

# Worker.ErrorSavingWords
source: An error occurred while saving words.
de: Beim Speichern der Wörter ist ein Fehler aufgetreten.
et: Sõnade salvestamisel ilmnes viga.
fr: Une erreur s'est produite lors de l'enregistrement des mots.
pl: Wystąpił błąd podczas zapisywania słów.
ru: Произошла ошибка при сохранении слов.
tr: Kelimeler kaydedilirken bir hata oluştu.
zh_cn: 保存单词时发生错误。

# Worker.LearningModeChangedToBinary
source: Learning mode changed to binary
de: Lernmodus auf binär geändert
et: Õpperežiim muudetud binaarseks
fr: Mode d'apprentissage changé en binaire
pl: Tryb nauki zmieniono na binarny
ru: Режим обучения изменён на бинарный
tr: Öğrenme modu ikili olarak değiştirildi
zh_cn: 学习模式已更改为二进制

# Worker.AlreadyUsingBinaryLearningMode
source: You are already using binary learning mode
de: Sie verwenden bereits den binären Lernmodus
et: Kasutate juba binaarset õpperežiimi
fr: Vous utilisez déjà le mode d'apprentissage binaire
pl: Już używasz trybu binarnego
ru: Вы уже используете бинарный режим обучения
tr: Zaten ikili öğrenme modunu kullanıyorsunuz
zh_cn: 您已在使用二进制学习模式

# Worker.LearningModeChangedToMultipleChoice
source: Learning mode changed to multiple choice
de: Lernmodus auf Multiple-Choice geändert
et: Õpperežiim muudetud valikvastustega
fr: Mode d'apprentissage changé en choix multiple
pl: Tryb nauki zmieniono na wybór wielokrotny
ru: Режим обучения изменён на множественный выбор
tr: Öğrenme modu çoktan seçmeli olarak değiştirildi
zh_cn: 学习模式已更改为多项选择

# Worker.AlreadyUsingMultipleChoiceLearningMode
source: You are already using multiple choice learning mode
de: Sie verwenden bereits den Multiple-Choice-Lernmodus
et: Kasutate juba valikvastustega õpperežiimi
fr: Vous utilisez déjà le mode d'apprentissage à choix multiples
pl: Już używasz trybu wielokrotnego wyboru
ru: Вы уже используете режим множественного выбора
tr: Zaten çoktan seçmeli öğrenme modunu kullanıyorsunuz
zh_cn: 您已在使用多项选择学习模式

# Worker.ConfirmDictionaryDeletion
source: Delete dictionary? Words will be completely removed.
de: Wörterbuch löschen? Wörter werden vollständig entfernt.
et: Kustuta sõnastik? Sõnad eemaldatakse täielikult.
fr: Supprimer le dictionnaire ? Les mots seront complètement supprimés.
pl: Usunąć słownik? Słowa zostaną całkowicie usunięte.
ru: Удалить словарь? Слова будут удалены полностью.
tr: Sözlüğü silmek mi? Kelimeler tamamen kaldırılacak.
zh_cn: 删除词典？单词将完全删除。

# Worker.ConfirmDictionaryDeletionMoveToDefault
source: Delete dictionary? Words will be moved to the general dictionary.
de: Wörterbuch löschen? Wörter werden in das allgemeine Wörterbuch verschoben.
et: Kustuta sõnastik? Sõnad teisaldatakse üldisesse sõnastikku.
fr: Supprimer le dictionnaire ? Les mots seront déplacés vers le dictionnaire général.
pl: Usunąć słownik? Słowa zostaną przeniesione do ogólnego.
ru: Удалить словарь? Слова будут перенесены в общий.
tr: Sözlüğü silmek mi? Kelimeler genel sözlüğe taşınacak.
zh_cn: 删除词典？单词将移动到通用词典。

# Worker.ButtonYes
source: Yes
de: Ja
et: Jah
fr: Oui
pl: Tak
ru: Да
tr: Evet
zh_cn: 是

# Worker.ButtonNo
source: No
de: Nein
et: Ei
fr: Non
pl: Nie
ru: Нет
tr: Hayır
zh_cn: 不

# Worker.InvalidIdentifier
source: Invalid identifier
de: Ungültiger Bezeichner
et: Kehtetu identifikaator
fr: Identifiant invalide
pl: Nieprawidłowy identyfikator
ru: Некорректный идентификатор
tr: Geçersiz kimlik
zh_cn: 无效标识符

# Worker.UserNotFound
source: User not found
de: Benutzer nicht gefunden
et: Kasutajat ei leitud
fr: Utilisateur introuvable
pl: Użytkownik nie znaleziony
ru: Пользователь не найден
tr: Kullanıcı bulunamadı
zh_cn: 未找到用户

# Worker.DictionaryNotFound
source: Dictionary not found
de: Wörterbuch nicht gefunden
et: Sõnastikku ei leitud
fr: Dictionnaire introuvable
pl: Słownik nie znaleziony
ru: Словарь не найден
tr: Sözlük bulunamadı
zh_cn: 未找到词典

# Worker.CannotDeleteDefaultDictionary
source: Cannot delete the default dictionary
de: Standardwörterbuch kann nicht gelöscht werden
et: Vaikesõnastikku ei saa kustutada
fr: Impossible de supprimer le dictionnaire par défaut
pl: Nie można usunąć domyślnego słownika
ru: Нельзя удалить общий словарь
tr: Varsayılan sözlük silinemez
zh_cn: 无法删除默认词典

# Worker.WelcomeMessage
source: Hi, I'm <b>WordBot</b> – your assistant in learning foreign words!\nAdd your own dictionaries, practice with flashcards, and track your progress.\nReady to start?
de: Hallo, ich bin
et: Tere, mina olen
fr: Salut, je suis
pl: Cześć, jestem <b>WordBot</b> – Twój pomocnik w nauce słówek! Dodawaj własne słowniki, ćwicz z fiszkami i śledź postępy. Gotowy do startu?
ru: Привет, я <b>WordBot</b> – твой помощник в изучении иностранных слов!Добавляй собственные словари, тренируйся с карточками и следи за прогрессом.Готов начать?
tr: Merhaba, ben
zh_cn: 你好，我是

# Worker.WhatLanguageToLearn
source: What language do you want to learn?
de: Welche Sprache möchten Sie lernen?
et: Millist keelt soovite õppida?
fr: Quelle langue voulez-vous apprendre ?
pl: Jakiego języka chcesz się uczyć?
ru: Какой язык хотите изучать?
tr: Hangi dili öğrenmek istiyorsunuz?
zh_cn: 您想学习哪种语言？

# Worker.AddLanguageFirst
source: First, add a language via /addlanguage
de: Fügen Sie zuerst eine Sprache über /addlanguage hinzu
et: Esmalt lisage keel /addlanguage kaudu
fr: Ajoutez d'abord une langue via /addlanguage
pl: Najpierw dodaj język przez /addlanguage
ru: Сначала добавьте язык через /addlanguage
tr: Önce /addlanguage ile bir dil ekleyin
zh_cn: 首先通过 /addlanguage 添加一种语言

# Worker.EnterWordToRemember
source: Enter a word to memorize:
de: Geben Sie ein Wort zum Auswendiglernen ein:
et: Sisestage meeldejätmiseks sõna:
fr: Entrez un mot à mémoriser :
pl: Wpisz słowo do zapamiętania:
ru: Введите слово для запоминания:
tr: Ezberlemek istediğiniz kelimeyi girin:
zh_cn: 输入要记住的单词:

# Worker.EnterLanguageName
source: Enter the language name:
de: Geben Sie den Sprachnamen ein:
et: Sisestage keele nimi:
fr: Entrez le nom de la langue :
pl: Podaj nazwę języka:
ru: Введите название языка:
tr: Dilin adını girin:
zh_cn: 输入语言名称:

# Worker.UsageRemoveLanguage
source: Use /removelanguage [code]
de: Verwenden Sie /removelanguage [Code]
et: Kasutage /removelanguage [kood]
fr: Utilisez /removelanguage [code]
pl: Użyj /removelanguage [kod]
ru: Используйте /removelanguage [код]
tr: Kullanım: /removelanguage [kod]
zh_cn: 使用 /removelanguage [代码]

# Worker.LanguageListEmpty
source: The list is empty.
de: Die Liste ist leer.
et: Nimekiri on tühi.
fr: La liste est vide.
pl: Lista jest pusta.
ru: Список пуст.
tr: Liste boş.
zh_cn: 列表为空。

# Worker.YourLearningLanguages
source: You are learning: {0}
de: Sie lernen:\n{0}
et: Te õpite:\n{0}
fr: Vous apprenez : {0}
pl: Uczysz się: {0}
ru: Вы изучаете:{0}
tr: Öğreniyorsunuz:\n{0}
zh_cn: 您正在学习:{0}

# Worker.ResettingData
source: Resetting data...
de: Daten werden zurückgesetzt...
et: Andmete lähtestamine...
fr: Réinitialisation des données...
pl: Resetowanie danych...
ru: Сброс данных...
tr: Veriler sıfırlanıyor...
zh_cn: 正在重置数据...

# Worker.Done
source: Done
de: Fertig
et: Valmis
fr: Terminé
pl: Gotowe
ru: Готово
tr: Bitti
zh_cn: 完成

# Worker.ExampleRemoveWord
source: example: /removeword word
de: Beispiel: /removeword Wort
et: Näide: /removeword sõna
fr: Exemple : /removeword mot
pl: przykład: /removeword słowo
ru: пример: /removeword слово
tr: örnek: /removeword kelime
zh_cn: 示例: /removeword 单词

# Worker.WordXDeleted
source: Word '{0}' deleted
de: Wort „{0}“ gelöscht
et: Sõna „{0}“ kustutatud
fr: Mot „{0}“ supprimé
pl: Słowo '{0}' usunięte
ru: Слово '{0}' удалено
tr: „{0}“ kelimesi silindi
zh_cn: 单词“{0}”已删除

# Worker.WordXNotFound
source: Word '{0}' not found
de: Wort „{0}“ nicht gefunden
et: Sõna „{0}“ ei leitud
fr: Mot „{0}“ introuvable
pl: Słowo '{0}' nie znalezione
ru: Слово '{0}' не найдено
tr: „{0}“ kelimesi bulunamadı
zh_cn: 未找到单词“{0}”

# Worker.UsageTodo
source: Use /todo Text : Description
de: Verwenden Sie /todo Text : Beschreibung
et: Kasutage /todo Tekst : Kirjeldus
fr: Utilisez /todo Texte : Description
pl: Użyj /todo Tekst : Opis
ru: Используйте /todo Текст : Описание
tr: Kullanım: /todo Metin : Açıklama
zh_cn: 使用 /todo 文本 : 描述

# Worker.TaskAdded
source: Task added
de: Aufgabe hinzugefügt
et: Ülesanne lisatud
fr: Tâche ajoutée
pl: Zadanie dodane
ru: Задача добавлена
tr: Görev eklendi
zh_cn: 任务已添加

# Worker.AccessDenied
source: Access denied
de: Zugriff verweigert
et: Juurdepääs keelatud
fr: Accès refusé
pl: Brak dostępu
tr: Erişim reddedildi
zh_cn: 访问被拒绝

# Worker.UnknownCommand
source: Unknown command. Use the menu or /start.
de: Unbekannter Befehl. Verwenden Sie das Menü oder /start.
et: Tundmatu käsk. Kasutage menüüd või /start.
fr: Commande inconnue. Utilisez le menu ou /start.
pl: Nieznana komenda. Użyj menu lub /start.
ru: Неизвестная команда. Используйте меню или /start.
tr: Bilinmeyen komut. Menüyü veya /start'ı kullanın.
zh_cn: 未知命令。请使用菜单或 /start。

# Worker.ThemeCannotBeEmpty
source: Theme cannot be empty.
de: Das Thema darf nicht leer sein.
et: Teema ei saa olla tühi.
fr: Le thème ne peut pas être vide.
pl: Temat nie może być pusty.
ru: Тема не может быть пустой.
tr: Tema boş olamaz.
zh_cn: 主题不能为空。

# Worker.ReceivedXWordsForTheme
source: Received {0} words for the topic '{1}'. Which dictionary to save to?
de: {0} Wörter zum Thema „{1}“ erhalten.\nIn welchem Wörterbuch speichern?
et: Saadud {0} sõna teema „{1}“ kohta.\nMillisesse sõnastikku salvestada?
fr: Reçu {0} mots pour le sujet „{1}“. Dans quel dictionnaire sauvegarder ?
pl: Otrzymano {0} słów na temat '{1}'. Do którego słownika zapisać?
ru: Получено {0} слов по теме '{1}'.В какой словарь сохранить?
tr: Konu '{1}' için {0} kelime alındı.\nHangi sözlüğe kaydedilsin?
zh_cn: 收到关于主题“{1}”的 {0} 个单词。保存到哪个词典？

# Worker.DictionaryNameCannotBeEmpty
source: Dictionary name cannot be empty.
de: Der Wörterbuchname darf nicht leer sein.
et: Sõnastiku nimi ei saa olla tühi.
fr: Le nom du dictionnaire ne peut pas être vide.
pl: Nazwa słownika nie może być pusta.
ru: Название словаря не может быть пустым.
tr: Sözlük adı boş olamaz.
zh_cn: 词典名称不能为空。

# Worker.DictionaryXCreated
source: Dictionary '{0}' created successfully.
de: Wörterbuch „{0}“ erfolgreich erstellt.
et: Sõnastik „{0}“ edukalt loodud.
fr: Dictionnaire „{0}“ créé avec succès.
pl: Słownik '{0}' pomyślnie utworzony.
ru: Словарь '{0}' успешно создан.
tr: „{0}“ sözlüğü başarıyla oluşturuldu.
zh_cn: 词典“{0}”已成功创建。

# Worker.Add20WordsToDictionaryConfirmation
source: Automatically add 20 words on the topic {0}?
de: Automatisch 20 Wörter zum Thema {0} hinzufügen?
et: Lisada automaatselt 20 sõna teema {0} kohta?
fr: Ajouter automatiquement 20 mots sur le sujet {0} ?
pl: Dodać automatycznie 20 słów na temat {0}?
ru: Добавить автоматически 20 слов по теме {0}?
tr: Konu {0} ile ilgili 20 kelimeyi otomatik olarak eklemek ister misiniz?
zh_cn: 是否自动添加关于主题 {0} 的 20 个单词？

# Worker.NoWordsInLanguage
source: ❌ You have no added languages.
de: ❌ Sie haben keine Sprachen hinzugefügt.
et: ❌ Teil pole lisatud keeli.
fr: ❌ Vous n'avez pas de langues ajoutées.
pl: ❌ Nie masz dodanych języków.
ru: ❌ У вас нет добавленных языков.
tr: ❌ Eklenmiş diliniz yok.
zh_cn: ❌ 您没有添加任何语言。

# Worker.NoWordsHeader
source: {0}\nNo words.
de: {0}\nKeine Wörter.
et: {0}\nSõnu pole.
fr: {0} Pas de mots.
pl: {0} Brak słów.
ru: {0}Нет слов.
tr: {0}\nKelime yok.
zh_cn: {0}没有单词。

# Worker.NavigateWordsWithButtons
source: {0}\nUse the «⬅️» and «➡️» buttons to navigate.
de: {0}\nVerwenden Sie die Schaltflächen „⬅️“ und „➡️“ zum Navigieren.
et: {0}\nKasutage navigeerimiseks nuppe „⬅️“ ja „➡️“.
fr: {0} Utilisez les boutons «⬅️» et «➡️» pour naviguer.
pl: {0} Użyj przycisków «⬅️» i «➡️» aby nawigować.
ru: {0}Используйте кнопки «⬅️» и «➡️» для навигации.
tr: {0}\nNavigasyon için „⬅️” ve „➡️” düğmelerini kullanın.
zh_cn: {0}使用“⬅️”和“➡️”按钮进行导航。

# Worker.NoWordsToList
source: ❌ No words.
de: ❌ Keine Wörter.
et: ❌ Sõnu pole.
fr: ❌ Pas de mots.
pl: ❌ Brak słów.
ru: ❌ Нет слов.
tr: ❌ Kelime yok.
zh_cn: ❌ 没有单词。

# Worker.PageXofY
source: === Page {0}/{1} ===
de: === Seite {0}/{1} ===
et: === Lk {0}/{1} ===
pl: === Str. {0}/{1} ===
ru: === Стр. {0}/{1} ===
tr: === Sayfa {0}/{1} ===
zh_cn: === 第 {0}/{1} 页 ===

# Worker.EnterWordNumbersToDelete
source: Enter word numbers to delete
de: separated by spaces:
et: Geben Sie die zu löschenden Wortnummern durch Leerzeichen getrennt ein:
fr: Sisestage kustutatavate sõnade numbrid tühikutega eraldatult:
pl: Podaj numery słów do usunięcia, oddzielone spacją:
ru: Введите номера слов для удаления через пробел:
tr: séparés par des espaces :
zh_cn: Wprowadź numery słów do usunięcia

# Worker.NumbersNotRecognized
source: Numbers not recognized
de: Nummern nicht erkannt
et: Numbreid ei tuvastatud
fr: Numéros non reconnus
pl: Nie rozpoznano numerów
ru: Не распознаны номера
tr: Numaralar tanınmadı
zh_cn: 号码未识别

# Worker.WordsDeletedCount
source: Words deleted: {0}
de: Gelöschte Wörter: {0}
et: Kustutatud sõnu: {0}
fr: Mots supprimés : {0}
pl: Usunięto słów: {0}
ru: Удалено слов: {0}
tr: Silinen kelime sayısı: {0}
zh_cn: 已删除单词数: {0}

# Worker.ErrorTelegramAPI
source: Telegram API Error: {0}
de: Telegram API Fehler: {0}
et: Telegram API viga: {0}
fr: Erreur de l'API Telegram : {0}
pl: Błąd Telegram API: {0}
tr: Telegram API Hatası: {0}
zh_cn: Telegram API 错误: {0}

# Worker.ErrorProcessingUpdate
source: Error processing update
de: Fehler bei der Aktualisierungsverarbeitung
et: Viga värskenduse töötlemisel
fr: Erreur de traitement de la mise à jour
pl: Błąd przetwarzania aktualizacji
ru: Ошибка обработки обновления
tr: Güncelleme işlenirken hata oluştu
zh_cn: 处理更新时出错

# Worker.WordToSaveNotFound
source: Word to save not found
de: Zu speicherndes Wort nicht gefunden
et: Salvestatavat sõna ei leitud
fr: Mot à enregistrer introuvable
pl: Nie znaleziono słowa do zapisania
ru: Не найдено слово для сохранения
tr: Kaydedilecek kelime bulunamadı
zh_cn: 未找到要保存的单词

# Worker.WordAdded
source: Added «{0}»
de: Hinzugefügt „{0}“
et: Lisatud „{0}“
fr: Ajouté «{0}»
pl: Dodano «{0}»
ru: Добавлено «{0}»
tr: Eklendi «{0}»
zh_cn: 已添加“{0}”

# Worker.ErrorLoadingWord
source: Error loading word
de: Fehler beim Laden des Wortes
et: Sõna laadimisel ilmnes viga
fr: Erreur lors du chargement du mot
pl: Błąd ładowania słowa
ru: Ошибка при загрузке слова
tr: Kelime yüklenirken hata oluştu
zh_cn: 加载单词时出错

# Worker.ErrorAiTranslation
source: AI translation error
de: KI-Übersetzungsfehler
et: AI-tõlke viga
fr: Erreur de traduction IA
pl: Błąd tłumaczenia AI
ru: Ошибка AI-перевода
tr: AI çeviri hatası
zh_cn: AI 翻译错误

# Worker.EditTranslationsPrompt
source: Edit translations:
de: Übersetzungen bearbeiten:
et: Redigeeri tõlkeid:
fr: Modifiez les traductions :
pl: Edytuj tłumaczenia:
ru: Редактируйте переводы:
tr: Çevirileri düzenle:
zh_cn: 编辑翻译:

# Worker.EditExamplesPrompt
source: Edit examples:
de: Beispiele bearbeiten:
et: Redigeeri näiteid:
fr: Modifiez les exemples :
pl: Edytuj przykłady:
ru: Редактируйте примеры:
tr: Örnekleri düzenle:
zh_cn: 编辑示例:

# Worker.WordUpdated
source: Updated «{0}»
de: Aktualisiert „{0}“
et: Uuendatud „{0}“
fr: Mis à jour «{0}»
pl: Zaktualizowano «{0}»
ru: Обновлено «{0}»
tr: Güncellendi «{0}»
zh_cn: 已更新“{0}”

# Worker.EmptyQuery
source: Empty query
de: Leere Abfrage
et: Tühi päring
fr: Requête vide
pl: Puste zapytanie
ru: Пустой запрос
tr: Boş sorgu
zh_cn: 空查询

# Worker.NothingFound
source: Nothing found
de: Nichts gefunden
et: Midagi ei leitud
fr: Rien trouvé
pl: Nic nie znaleziono
ru: Ничего не найдено
tr: Hiçbir şey bulunamadı
zh_cn: 未找到任何内容

# Worker.SelectWordPrompt
source: Select a word:
de: Wählen Sie ein Wort:
et: Valige sõna:
fr: Sélectionnez un mot :
pl: Wybierz słowo:
ru: Выберите слово:
tr: Bir kelime seçin:
zh_cn: 选择一个单词:

# Worker.InvalidLanguageId
source: Invalid language ID.
de: Ungültige Sprach-ID.
et: Kehtetu keele ID.
fr: ID de langue invalide.
pl: Nieprawidłowy identyfikator języka.
ru: Неверный идентификатор языка.
tr: Geçersiz dil kimliği.
zh_cn: 无效的语言ID。

# Worker.LanguageNotOnYourList
source: This language is not found in your list.
de: Diese Sprache wurde in Ihrer Liste nicht gefunden.
et: Seda keelt teie loendist ei leitud.
fr: Cette langue n'est pas trouvée dans votre liste.
pl: Ten język nie znajduje się na twojej liście.
ru: Этот язык не найден в вашем списке.
tr: Bu dil listenizde bulunamadı.
zh_cn: 此语言不在您的列表中。

# Worker.CurrentLanguageSwitched
source: Current language switched to «{0}».
de: Aktuelle Sprache auf „{0}“ umgeschaltet.
et: Praegune keel lülitatud keelele „{0}“.
fr: Langue actuelle passée à «{0}».
pl: Bieżący język przełączono na «{0}».
ru: Текущий язык переключён на «{0}».
tr: Mevcut dil «{0}» olarak değiştirildi.
zh_cn: 当前语言已切换到“{0}”。

# Worker.LanguageChangedSuccessfully
source: Language changed successfully.
de: Sprache erfolgreich geändert.
et: Keele muutmine õnnestus.
fr: Langue changée avec succès.
pl: Język pomyślnie zmieniony.
ru: Язык успешно изменён.
tr: Dil başarıyla değiştirildi.
zh_cn: 语言已成功更改。
