Repository: YuraFilionchik/TelegramWordBot
Catalog: Resources/SharedResource.*.resx
Languages: de, et, fr, pl, ru, tr, zh_cn

# Keyboard.Statistics.ByLanguage
source: 🔍 By language
de: 🔍 Nach Sprachen
et: 🔍 Keele järgi
fr: 🔍 Par langue
pl: 🔍 Według języka
ru: 🔍 По языкам
tr: 🔍 Dile göre
zh_cn: 🔍 按语言

# Keyboard.Profile.UserInfo
source: 👤 User info
de: 👤 Benutzerinfo
et: 👤 Kasutajainfo
fr: 👤 Infos utilisateur
pl: 👤 Informacje o użytkowniku
ru: 👤 Инфо о пользователе
tr: 👤 Kullanıcı bilgisi
zh_cn: 👤 用户信息

# Keyboard.Profile.AdminDashboard
source: 🛠 Admin Dashboard
et: 🛠 Administraatori juhtpaneel
fr: 🛠 Tableau de bord administrateur
pl: 🛠 Panel admina
tr: 🛠 Yönetici Paneli
zh_cn: 🛠 管理仪表板

# Keyboard.Profile.ResetStatistics
source: 🔄 Reset statistics
de: 🔄 Statistiken zurücksetzen
et: 🔄 Lähtesta statistika
fr: 🔄 Réinitialiser les statistiques
pl: 🔄 Resetuj statystyki
ru: 🔄 Сбросить статистику
tr: 🔄 İstatistikleri sıfırla
zh_cn: 🔄 重置统计数据

# Keyboard.DictionaryManage.Edit
source: ✏️ Edit
de: ✏️ Bearbeiten
et: ✏️ Muuda
fr: ✏️ Modifier
pl: ✏️ Edytuj
ru: ✏️ Редактировать
tr: ✏️ Düzenle
zh_cn: ✏️ 编辑

# Keyboard.DictionaryManage.ResetProgress
source: 🔄 Reset progress
de: 🔄 Fortschritt zurücksetzen
et: 🔄 Lähtesta edenemine
fr: 🔄 Réinitialiser la progression
pl: 🔄 Resetuj postęp
ru: 🔄 Обнулить прогресс
tr: 🔄 İlerlemeyi sıfırla
zh_cn: 🔄 重置进度

# Keyboard.DictionaryManage.Delete
source: 🗑️ Delete dictionary
de: 🗑️ Wörterbuch löschen
et: 🗑️ Kustuta sõnastik
fr: 🗑️ Supprimer le dictionnaire
pl: 🗑️ Usuń słownik
ru: 🗑️ Удалить словарь
tr: 🗑️ Sözlüğü sil
zh_cn: 🗑️ 删除词典

# Keyboard.DictionaryList.DefaultName
source: General
de: Allgemein
et: Üldine
fr: Général
pl: Ogólny
ru: Общий
tr: Genel
zh_cn: 通用

# Keyboard.DictionaryList.CreateNew
source: Create new
de: Neu erstellen
et: Loo uus
fr: Créer un nouveau
pl: Utwórz nowy
ru: Создать новый
tr: Yeni oluştur
zh_cn: 创建新的

# Keyboard.TopicDictionary.DeleteDictionaryNoWords
source: 🗑️ Delete dictionary (without words)
de: 🗑️ Wörterbuch löschen (ohne Wörter)
et: 🗑️ Kustuta sõnastik (ilma sõnadeta)
fr: 🗑️ Supprimer le dictionnaire (sans mots)
pl: 🗑️ Usuń słownik (bez słów)
ru: 🗑️ Удалить словарь (без слов)
tr: 🗑️ Sözlüğü sil (kelimesiz)
zh_cn: 🗑️ 删除词典（无单词）

# Keyboard.TopicDictionary.DeleteDictionaryAndWords
source: 🗑️ Delete dictionary and words
de: 🗑️ Wörterbuch und Wörter löschen
et: 🗑️ Kustuta sõnastik ja sõnad
fr: 🗑️ Supprimer le dictionnaire et les mots
pl: 🗑️ Usuń słownik i słowa
ru: 🗑️ Удалить словарь и слова
tr: 🗑️ Sözlüğü ve kelimeleri sil
zh_cn: 🗑️ 删除词典和单词

# Keyboard.TopicDictionary.DeleteMultipleWords
source: 🗑️ Delete multiple words
de: 🗑️ Mehrere Wörter löschen
et: 🗑️ Kustuta mitu sõna
fr: 🗑️ Supprimer plusieurs mots
pl: 🗑️ Usuń wiele słów
ru: 🗑️ Удалить несколько слов
tr: 🗑️ Birden fazla kelimeyi sil
zh_cn: 🗑️ 删除多个单词

# Keyboard.TopicDictionaryMenu.DeleteDictionary
source: 🗑️ Delete dictionary
de: 🗑️ Wörterbuch löschen
et: 🗑️ Kustuta sõnastik
fr: 🗑️ Supprimer le dictionnaire
pl: 🗑️ Usuń słownik
ru: 🗑️ Удалить словарь
tr: 🗑️ Sözlüğü sil
zh_cn: 🗑️ 删除词典

# Keyboard.TopicDictionaryMenu.DeleteMultipleWords
source: 🗑️ Delete multiple words
de: 🗑️ Mehrere Wörter löschen
et: 🗑️ Kustuta mitu sõna
fr: 🗑️ Supprimer plusieurs mots
pl: 🗑️ Usuń wiele słów
ru: 🗑️ Удалить несколько слов
tr: 🗑️ Birden fazla kelimeyi sil
zh_cn: 🗑️ 删除多个单词

# Keyboard.TopicDictionaryMenu.Back
source: ⬅️ Back
de: ⬅️ Zurück
et: ⬅️ Tagasi
fr: ⬅️ Retour
pl: ⬅️ Wstecz
ru: ⬅️ Назад
tr: ⬅️ Geri
zh_cn: ⬅️ 返回

# Keyboard.ShowTopicDictionaryMenu.Dictionary
source: Dictionary:
de: Wörterbuch:
et: Sõnastik:
fr: Dictionnaire :
pl: Słownik:
ru: Словарь:
tr: Sözlük:
zh_cn: 词典:

# Keyboard.ShowMainMenu.MainMenu
source: Main menu:
de: Hauptmenü:
et: Peamenüü:
fr: Menu principal :
pl: Menu główne:
ru: Главное меню:
tr: Ana menü:
zh_cn: 主菜单:

# Keyboard.HideMainMenu.MenuHidden
source: Menu hidden.
de: Menü ausgeblendet.
et: Menüü peidetud.
fr: Menu caché.
pl: Menu ukryte.
ru: Меню скрыто.
tr: Menü gizli.
zh_cn: 菜单已隐藏。

# Keyboard.ShowConfigMenu.Settings
source: Settings:
de: Einstellungen:
et: Seaded:
fr: Paramètres :
pl: Ustawienia:
ru: Настройки:
tr: Ayarlar:
zh_cn: 设置:

# Keyboard.ShowMyWordsMenu.MyWords
source: My words:
de: Meine Wörter:
et: Minu sõnad:
fr: Mes mots :
pl: Moje słowa:
ru: Мои слова:
tr: Kelimelerim:
zh_cn: 我的单词:

# Keyboard.ShowLearnConfig.LearnModePrompt
source: Word display mode during learning
de: Wortanzeigemodus während des Lernens
et: Sõnade kuvamisrežiim õppimise ajal
fr: Mode d'affichage des mots pendant l'apprentissage
pl: Sposób wyświetlania słów w trakcie nauki
ru: Режим показа слов при обучении
tr: Öğrenirken kelime görüntüleme modu
zh_cn: 学习时的单词显示模式

# Keyboard.ShowStatisticsMenu.Statistics
source: Statistics:
de: Statistik:
et: Statistika:
fr: Statistiques :
pl: Statystyki:
ru: Статистика:
tr: İstatistikler:
zh_cn: 统计:

# Keyboard.ShowProfileMenu.Profile
source: Profile:
de: Profil:
et: Profiil:
fr: Profil :
pl: Profil:
ru: Профиль:
tr: Profil:
zh_cn: 个人资料:

# Worker.ButtonDone
source: ✅ Done
de: ✅ Fertig
et: ✅ Valmis
fr: ✅ Terminé
pl: ✅ Gotowe
ru: ✅ Готово
tr: ✅ Bitti
zh_cn: ✅ 完成

# Worker.ButtonKnowSkip
source: Know/Don't show
de: Kennen/Nicht anzeigen
et: Tead/Ära näita
fr: Connaître/Ne pas afficher
pl: Znam/Nie pokazuj
ru: Знаю/Не показывать
tr: Biliyorum/Gösterme
zh_cn: 知道/不显示

# Worker.ButtonRemembered
source: ✅ Remembered
de: ✅ Erinnert
et: ✅ Mäletan
fr: ✅ Rappelé
pl: ✅ Zapamiętane
ru: ✅ Вспомнил
tr: ✅ Hatırladım
zh_cn: ✅ 记住了

# Worker.ButtonNotRemembered
source: ❌ Forgot
de: ❌ Vergessen
et: ❌ Ei mäleta
fr: ❌ Oublié
pl: ❌ Nie zapamiętane
ru: ❌ Не вспомнил
tr: ❌ Unuttum
zh_cn: ❌ 忘记了

# Worker.ButtonCancel
source: cancel
de: Abbrechen
et: Tühista
fr: Annuler
pl: anuluj
tr: İptal
zh_cn: 取消

# Worker.ButtonNewTheme
source: New: {0}
de: Neu: {0}
et: Uus: {0}
fr: Nouveau : {0}
pl: Nowy: {0}
ru: Новый: {0}
tr: Yeni: {0}
zh_cn: 新: {0}

# Worker.TimeRemainingDaysHours
source: in {0} d {1} h
fr: dans {0} j {1} h
ru: через {0} д. {1} ч.
zh_cn: {0}天{1}小时后

# Worker.TimeRemainingHoursMinutes
source: in {0} h {1} m
fr: dans {0} h {1} min
ru: через {0} ч. {1} мин.
zh_cn: {0}小时{1}分钟后

# Worker.ProfileId
source: ID: <code>{0}</code>
de: ID:
et: ID:
fr: ID :
tr: Kimlik:
zh_cn: ID:

# TelegramMessageHelper.InfoMessage
source: ℹ️<i>{0}</i>
de: ℹ️
et: ℹ️
fr: ℹ️
tr: ℹ️
zh_cn: ℹ️

# Keyboard.Profile.TodoApp
source: 📝 Todo App
et: 📝 Todo rakendus
fr: 📝 Application Todo
tr: 📝 Yapılacaklar Uygulaması
zh_cn: 📝 待办事项应用
