Repository: YuraFilionchik/TelegramWordBot
Catalog: Resources/SharedResource.*.resx
Languages: de, et, fr, pl, ru, tr, zh_cn

# Worker.NoLanguagesToSwitch
source: You don't have any languages to study yet.
de: Sie haben noch keine Sprachen zum Lernen.
et: Teil pole veel ühtegi õpitavat keelt.
fr: Vous n'avez pas encore de langues à étudier.
pl: Nie masz jeszcze żadnych języków do nauki.
ru: У вас ещё нет ни одного изучаемого языка.
tr: Henüz çalışmak için herhangi bir diliniz yok.
zh_cn: 您还没有任何要学习的语言。

# Worker.SelectCurrentLanguagePrompt
source: Select the language you want to make current:
de: Wählen Sie die Sprache
et: die Sie zur aktuellen Sprache machen möchten:
fr: Valige keel
pl: Wybierz język, który chcesz ustawić jako bieżący:
ru: Выберите язык, который хотите сделать текущим:
tr: Sélectionnez la langue que vous souhaitez définir comme langue actuelle :
zh_cn: Wybierz język

# Worker.CorrectAnswer
source: Correct! {0} = {1}
de: Richtig! {0} = {1}
et: Õige! {0} = {1}
pl: Poprawnie! {0} = {1}
ru: Верно! {0} = {1}
tr: Doğru! {0} = {1}
zh_cn: 正确！{0} = {1}

# Worker.IncorrectAnswer
source: Incorrect! {0} = {1}
de: Falsch! {0} = {1}
et: Vale! {0} = {1}
pl: Niepoprawnie! {0} = {1}
ru: Неправильно! {0} = {1}
tr: Yanlış! {0} = {1}
zh_cn: 不正确！{0} = {1}

# Worker.WordMarkedAsLearned
source: «{0}» marked as learned
de: „{0}“ als gelernt markiert
et: „{0}“ märgitud õpituks
fr: «{0}» marqué comme appris
pl: «{0}» oznaczono jako nauczone
ru: «{0}» помечено как выученное
tr: „{0}“ öğrenilmiş olarak işaretlendi
zh_cn: “{0}” 已标记为已学习

# Worker.NothingToRepeat
source: Nothing to repeat. You can add new words
de: Nichts zu wiederholen. Sie können neue Wörter hinzufügen
et: Midagi pole korrata. Saate lisada uusi sõnu
fr: Rien à répéter. Vous pouvez ajouter de nouveaux mots
pl: Nie ma czego powtarzać. Możesz dodać nowe słowa
ru: Нечего повторять. Можешь добавить новые слова
tr: Tekrar edilecek bir şey yok. Yeni kelimeler ekleyebilirsiniz
zh_cn: 没什么可重复的了。你可以添加新单词

# Worker.ChooseCorrectTranslationFor
source: Choose the correct translation for the word:
de: Wählen Sie die richtige Übersetzung für das Wort:
et: Valige sõna jaoks õige tõlge:
fr: Choisissez la bonne traduction pour le mot :
pl: Wybierz poprawne tłumaczenie słowa:
ru: Выберите правильный перевод для слова:
tr: Kelime için doğru çeviriyi seçin:
zh_cn: 选择单词的正确翻译:

# Worker.TranslateWordPrompt
source: Translate the word
de: Übersetzen Sie das Wort
et: Tõlgi sõna
fr: Traduisez le mot
pl: Przetłumacz słowo
ru: Переведите слово
tr: Kelimeyi çevir
zh_cn: 翻译单词

# Worker.LanguageXNotFound
source: Language {0} not found
de: Sprache {0} nicht gefunden
et: Keele {0} ei leitud
fr: Langue {0} introuvable
pl: Język {0} nie znaleziony
ru: Язык {0} не найден
tr: Dil {0} bulunamadı
zh_cn: 未找到语言 {0}

# Worker.LanguageXRemoved
source: Language {0} removed
de: Sprache {0} entfernt
et: Keele {0} eemaldatud
fr: Langue {0} supprimée
pl: Język {0} usunięty
ru: Язык {0} удалён
tr: Dil {0} kaldırıldı
zh_cn: 语言 {0} 已删除

# Worker.LanguagesNotSetup
source: Languages are not set up
de: Sprachen sind nicht eingerichtet
et: Keeled pole seadistatud
fr: Les langues ne sont pas configurées
pl: Języki nie są skonfigurowane
ru: Языки не настроены
tr: Diller ayarlanmadı
zh_cn: 语言未设置

# Worker.CouldNotDetectLanguage
source: Could not determine the language of the word
de: Die Sprache des Wortes konnte nicht ermittelt werden
et: Sõna keelt ei õnnestunud tuvastada
fr: Impossible de déterminer la langue du mot
pl: Nie udało się określić języka słowa
ru: Не удалось определить язык слова
tr: Kelimenin dili belirlenemedi
zh_cn: 无法检测到单词的语言

# Worker.LanguageXNotInDb
source: Language '{0}' is not in the database
de: Sprache „{0}“ nicht in der Datenbank
et: Keele „{0}“ pole andmebaasis
fr: La langue „{0}“ n'est pas dans la base de données
pl: Język '{0}' nie znajduje się w bazie
ru: Язык '{0}' не в базе
tr: Dil '{0}' veritabanında yok
zh_cn: 语言“{0}”不在数据库中

# Worker.WordAlreadyInYourDictionary
source: «{0}» is already in your dictionary.
de: „{0}“ ist bereits in Ihrem Wörterbuch.
et: „{0}“ on juba teie sõnastikus.
fr: «{0}» est déjà dans votre dictionnaire.
pl: «{0}» jest już w twoim słowniku.
ru: «{0}» уже есть в вашем словаре.
tr: „{0}“ zaten sözlüğünüzde.
zh_cn: “{0}” 已在您的词典中。

# Worker.WordXAddedToDefaultDictionary
source: «{0} - {1}» added to your general dictionary.
de: „{0} - {1}“ zu Ihrem allgemeinen Wörterbuch hinzugefügt.
et: „{0} - {1}“ lisatud teie üldisesse sõnastikku.
fr: «{0} - {1}» ajouté à votre dictionnaire général.
pl: «{0} - {1}» dodano do twojego ogólnego słownika.
ru: «{0} - {1}» добавлено в ваш общий словарь.
tr: „{0} - {1}“ genel sözlüğünüze eklendi.
zh_cn: “{0} - {1}” 已添加到您的通用词典。

# Worker.ChooseTranslationsPrompt
source: Select translation(s):
de: Wählen Sie die Übersetzung(en) aus:
et: Valige tõlke(d):
fr: Sélectionnez la ou les traductions :
pl: Wybierz tłumaczenie(a):
ru: Выберите перевод(ы):
tr: Çeviri(ler)i seçin:
zh_cn: 选择翻译:

# Worker.ChooseExamplesPrompt
source: Select usage examples:
de: Wählen Sie Anwendungsbeispiele aus:
et: Valige kasutusnäited:
fr: Sélectionnez des exemples d'utilisation :
pl: Wybierz przykłady użycia:
ru: Выберите примеры употребления:
tr: Kullanım örneklerini seçin:
zh_cn: 选择用法示例:

# Worker.CouldNotRecognizeLanguage
source: Could not recognize language
de: Sprache konnte nicht erkannt werden
et: Keele tuvastamine ebaõnnestus
fr: Impossible de reconnaître la langue
pl: Nie udało się rozpoznać języka
ru: Не удалось распознать язык
tr: Dil tanınamadı
zh_cn: 无法识别语言

# Worker.NativeLanguageSetTo
source: Native language set to: {0}
de: Muttersprache eingestellt auf: {0}
et: Emakeel määratud: {0}
fr: Langue maternelle définie sur : {0}
pl: Ustawiono język ojczysty: {0}
ru: Родной язык установлен: {0}
tr: Ana dil şu olarak ayarlandı: {0}
zh_cn: 母语设置为: {0}

# Worker.LanguageXAdded
source: Language {0} added. Select words via /addword or menu
de: Sprache {0} hinzugefügt. Wählen Sie Wörter über /addword oder das Menü aus
et: Keele {0} lisatud. Valige sõnad /addword või menüü kaudu
fr: Langue {0} ajoutée. Sélectionnez des mots via /addword ou le menu
pl: Język {0} dodany. Wybierz słowa przez /addword lub menu
ru: Язык {0} добавлен. Выберите слова через /addword или меню
tr: Dil {0} eklendi. /addword veya menü aracılığıyla kelimeleri seçin
zh_cn: 已添加语言 {0}。通过 /addword 或菜单选择单词

# Worker.EnterThemeToCreateDictionary
source: Enter a theme to create a dictionary with new words:
de: Geben Sie ein Thema ein
et: damit ich ein Wörterbuch mit neuen Wörtern erstellen kann:
fr: Sisestage teema
pl: Podaj temat, aby utworzyć słownik z nowymi słowami:
ru: Введите тему, чтобы я создал словарь с новыми словами:
tr: Entrez un thème pour que je puisse créer un dictionnaire avec de nouveaux mots :
zh_cn: Wprowadź temat

# Worker.TotalStatisticsHeader
source: 📈 <b>Overall Learning Statistics</b>
pl: 📈 <b>Łączne statystyki nauki</b>
ru: 📈 <b>Общая статистика изучения</b>

# Worker.TotalWords
source: Total words: <b>{0}</b>
de: Gesamtzahl der Wörter:
et: Sõnade koguarv:
fr: Total de mots :
pl: Łącznie słów: <b>{0}</b>
ru: Всего слов: <b>{0}</b>
tr: Toplam kelime:
zh_cn: 总词数:

# Worker.FullyLearnedWords
source: Fully learned: <b>{0}</b>
de: Vollständig gelernt:
et: Täielikult õpitud:
fr: Entièrement appris :
pl: Całkowicie nauczone: <b>{0}</b>
ru: Полностью выучено: <b>{0}</b>
tr: Tamamen öğrenildi:
zh_cn: 完全掌握:

# Worker.WordsInProgress
source: In progress: <b>{0}</b>
de: In Bearbeitung:
et: Töös:
fr: En cours :
pl: W trakcie: <b>{0}</b>
ru: В процессе: <b>{0}</b>
tr: Devam ediyor:
zh_cn: 进行中:

# Worker.Top10HardestWords
source: 🔟 <b>Top 10 Hardest Words</b>
pl: 🔟 <b>Top 10 najtrudniejszych słów</b>
ru: 🔟 <b>Топ-10 самых сложных слов</b>

# Worker.HardWordDisplay
source: |--> {0} |- Repetitions: {1} |- Ease Factor: {2} |- Next review in: {3} _______________________________
de: |--> {0}\n |- Erleichterungsfaktor: {1}\n |- Wiederholungen: {2}\n_______________________________
et: |--> {0}\n |- Lihtsuskordaja: {1}\n |- Kordused: {2}\n_______________________________
fr: |--> {0} |- Répétitions : {1} |- Facteur de facilité : {2} |- Prochaine révision : {3} _______________________________
pl: |--> {0} |- Wsp. łatwości: {1} |- Powtórzenia: {2} _______________________________
ru: |--> {0} |- Повторения: {1} |- Коэф. лёгкости: {2} |- След. повторение: {3} _______________________________
tr: |--> {0}\n |- Kolaylık Faktörü: {1}\n |- Tekrarlar: {2}\n_______________________________
zh_cn: |--> {0} |- 重复次数: {1} |- 难度系数: {2} |- 下次复习: {3} _______________________________

# Worker.NoWords
source: No words.
de: Keine Wörter.
et: Sõnu pole.
fr: Pas de mots.
pl: Brak słów.
ru: Нет слов.
tr: Kelime yok.
zh_cn: 没有单词。

# Worker.TodayStatisticsHeader
source: 📈 <b>Statistics for Today</b>
pl: 📈 <b>Statystyka za dziś</b>
ru: 📈 <b>Статистика за сегодня</b>

# Worker.WordsRepeatedToday
source: Words repeated: <b>{0}</b>
de: Wörter wiederholt:
et: Korratud sõnad:
fr: Mots répétés :
pl: Powtórzonych słów: <b>{0}</b>
ru: Повторено слов: <b>{0}</b>
tr: Tekrarlanan kelime sayısı:
zh_cn: 今日重复单词:

# Worker.WordsLearnedToday
source: Learned: <b>{0}</b>
de: Gelernt:
et: Õpitud:
fr: Appris :
pl: Nauczonych: <b>{0}</b>
ru: Выучено: <b>{0}</b>
tr: Öğrenildi:
zh_cn: 已学习:

# Worker.HardWordsHeader
source: 📈 <b>Difficult words:</b>
pl: <b>Trudne słowa:</b>
ru: 📈 <b>Сложные слова:</b>

# Worker.NoActivityToday
source: You haven't studied today yet.
de: Sie haben heute noch nicht gelernt.
et: Te pole täna veel õppinud.
fr: Vous n'avez pas encore étudié aujourd'hui.
pl: Dziś jeszcze nie ćwiczyłeś.
ru: Сегодня вы ещё не занимались.
tr: Bugün henüz ders çalışmadınız.
zh_cn: 您今天还没有学习。

# Worker.StatisticsByLanguageHeader
source: 📊 <b>Statistics by Language</b>
pl: 📊 <b>Statystyki według języka</b>
ru: 📊 <b>Статистика по языкам</b>

# Worker.LanguageStats
source: <b>{0}</b>Total words: <b>{1}</b>Learned: <b>{2}</b>In progress: <b>{3}</b>
de: \n
et: \n
pl: <b>{0}</b> Łącznie słów: <b>{1}</b> Nauczonych: <b>{2}</b> W trakcie: <b>{3}</b>
ru: <b>{0}</b>Всего слов: <b>{1}</b>Выучено: <b>{2}</b>В процессе: <b>{3}</b>
tr: \n

# Worker.NoDictionaries
source: You have no dictionaries.
de: Sie haben keine Wörterbücher.
et: Teil pole sõnastikke.
fr: Vous n'avez pas de dictionnaires.
pl: Nie masz słowników.
ru: У вас нет словарей.
tr: Sözlüğünüz yok.
zh_cn: 您没有词典。

# Worker.DictionariesByTopicsHeader
source: 📁 <b>Dictionaries by Topics</b>
pl: 📁 <b>Słowniki według tematów</b>
ru: 📁 <b>Словари по темам</b>

# Worker.DictionariesByLanguageHeader
source: 📚 <b>Dictionaries by Language</b>
pl: 📚 <b>Słowniki według języków</b>
ru: 📚 <b>Словари по языкам</b>

# Worker.UnknownLanguage
source: Unknown
de: Unbekannt
et: Tundmatu
fr: Inconnu
pl: Nieznany
ru: Неизвестный
tr: Bilinmeyen
zh_cn: 未知

# Worker.AllWordProgressReset
source: Progress for all words has been reset
de: Fortschritt für alle Wörter zurückgesetzt
et: Kõigi sõnade edenemine lähtestati
fr: Progression pour tous les mots réinitialisée
pl: Postęp wszystkich słów został zresetowany
ru: Прогресс по всем словам сброшен
tr: Tüm kelimelerin ilerlemesi sıfırlandı
zh_cn: 所有单词的进度已重置

# Worker.UserProfileHeader
source: 👤 <b>User Profile</b>
pl: 👤 <b>Profil użytkownika</b>
ru: 👤 <b>Профиль пользователя</b>

# Worker.ProfileNativeLanguage
source: Native language: <b>{0}</b>
de: Muttersprache:
et: Emakeel:
fr: Langue maternelle :
pl: Język ojczysty: <b>{0}</b>
ru: Родной язык: <b>{0}</b>
tr: Ana dil:
zh_cn: 母语:

# Worker.ProfileCurrentLanguage
source: Current language: <b>{0}</b>
de: Aktuelle Sprache:
et: Praegune keel:
fr: Langue actuelle :
pl: Aktualny język: <b>{0}</b>
ru: Текущий язык: <b>{0}</b>
tr: Mevcut dil:
zh_cn: 当前语言:

# Worker.ProfileLearningMode
source: Learning mode: <b>{0}</b>
de: Lernmodus:
et: Õpperežiim:
fr: Mode d'apprentissage :
pl: Tryb nauki: <b>{0}</b>
ru: Режим обучения: <b>{0}</b>
tr: Öğrenme modu:
zh_cn: 学习模式:

# Worker.ProfileLearningModeMultipleChoice
source: multiple choice
et: Valikvastustega
fr: Choix multiple
pl: wielokrotny wybór
ru: множественный выбор
tr: Çoktan seçmeli
zh_cn: 多项选择

# Worker.ProfileLearningModeBinary
source: binary
de: binär
et: binaarne
fr: binaire
pl: binarny
ru: бинарный
tr: ikili
zh_cn: 二进制

# Worker.ProfileStudiedLanguages
source: Languages studied: {0}
de: Gelernte Sprachen: {0}
et: Õpitud keeled: {0}
fr: Langues étudiées : {0}
pl: Uczone języki: {0}
ru: Изучаемые языки: {0}
tr: Öğrenilen diller: {0}
zh_cn: 学习的语言: {0}

# Worker.ProfileNoStudiedLanguages
source: none
de: keine
et: puudub
fr: aucun
pl: brak
ru: нет
tr: hiçbiri
zh_cn: 无

# Worker.ProfileTotalWords
source: Total words: <b>{0}</b>
de: Gesamtzahl der Wörter:
et: Sõnade koguarv:
fr: Total de mots :
pl: Łącznie słów: <b>{0}</b>
ru: Всего слов: <b>{0}</b>
tr: Toplam kelime:
zh_cn: 总词数:

# Worker.AllStatsReset
source: All statistics have been reset
de: Alle Statistiken wurden zurückgesetzt
et: Kogu statistika on lähtestatud
fr: Toutes les statistiques ont été réinitialisées
pl: Wszystkie statystyki zresetowane
ru: Вся статистика сброшена
tr: Tüm istatistikler sıfırlandı
zh_cn: 所有统计数据已重置

# Worker.AdminUsersHeader
source: 👥 Users<b>Users:</b>
de: 👥 Benutzer
et: 👥 Kasutajad
fr: 👥 Utilisateurs
pl: <b>Użytkownicy:</b>
ru: 👥 Пользователи<b>Users:</b>
tr: 👥 Kullanıcılar
zh_cn: 👥 用户

# Worker.AdminUserInfoLine1
source: ID: <code>{0}</code> | Username: {1} | First: {2} | Last: {3} | Last Seen: {4:g} | Premium: {5}
de: ID:
et: ID:
fr: ID :
pl: ID: <code>{0}</code> | Nazwa: {1} | Imię: {2} | Nazwisko: {3} | Ostatnio: {4:g} | Premium: {5}
tr: Kimlik:
zh_cn: ID:

# Worker.AdminUserInfoLine2
source: Native: {0} | Current: {1} | MC: {2}
de: Nativ: {0} | Aktuell: {1} | MC: {2}
et: Emakeel: {0} | Praegune: {1} | MC: {2}
fr: Natif : {0} | Actuel : {1} | MC : {2}
pl: Ojczysty: {0} | Bieżący: {1} | MC: {2}
tr: Yerel: {0} | Mevcut: {1} | ÇS: {2}
zh_cn: 母语: {0} | 当前: {1} | MC: {2}

# Worker.AdminUserWords
source: Words: {0}
de: Wörter: {0}
et: Sõnad: {0}
fr: Mots : {0}
pl: Słów: {0}
tr: Kelimeler: {0}
zh_cn: 单词: {0}

# Worker.AdminUserDictionaries
source: Dictionaries: {0}
de: Wörterbücher: {0}
et: Sõnastikud: {0}
fr: Dictionnaires : {0}
pl: Słowników: {0}
tr: Sözlükler: {0}
zh_cn: 词典: {0}

# Worker.AdminTotalWords
source: Total words: {0}
de: Gesamtzahl der Wörter: {0}
et: Sõnade koguarv: {0}
fr: Total de mots : {0}
pl: Razem słów: {0}
tr: Toplam kelime: {0}
zh_cn: 总词数: {0}

# Worker.DictionaryEmpty
source: Dictionary is empty.
de: Wörterbuch ist leer.
et: Sõnastik on tühi.
fr: Le dictionnaire est vide.
pl: Słownik jest pusty.
ru: Словарь пуст.
tr: Sözlük boş.
zh_cn: 词典为空。

# Worker.DictionaryNameHeader
source: 📚 Dictionary: {0}<b>{0}</b>
de: 📚 Wörterbuch: {0}
et: 📚 Sõnastik: {0}
fr: 📚 Dictionnaire : {0}
pl: <b>{0}</b>
ru: 📚 Словарь: {0}<b>{0}</b>
tr: 📚 Sözlük: {0}
zh_cn: 📚 词典: {0}

# Worker.DictionaryNameDefault
source: General
de: Allgemein
et: Üldine
fr: Général
pl: Ogólny
ru: Общий
tr: Genel
zh_cn: 通用

# Worker.NoWordsInDictionary
source: There are no words in the dictionary.
de: Es gibt keine Wörter im Wörterbuch.
et: Sõnastikus pole sõnu.
fr: Il n'y a pas de mots dans le dictionnaire.
pl: W słowniku nie ma słów.
ru: В словаре нет слов.
tr: Sözlükte kelime yok.
zh_cn: 词典中没有单词。

# Worker.DictionaryProgressReset
source: Dictionary progress has been reset
de: Wörterbuchfortschritt zurückgesetzt
et: Sõnastiku edenemine lähtestati
fr: Progression du dictionnaire réinitialisée
pl: Postęp słownika zresetowany
ru: Прогресс словаря сброшен
tr: Sözlük ilerlemesi sıfırlandı
zh_cn: 词典进度已重置

# Worker.DictionaryDeleted
source: Dictionary deleted
de: Wörterbuch gelöscht
et: Sõnastik kustutatud
fr: Dictionnaire supprimé
pl: Słownik usunięty
ru: Словарь удалён
tr: Sözlük silindi
zh_cn: 词典已删除

# Worker.HelpHeader
source: ❓ Help<b>Help</b>
de: ❓ Hilfe
et: ❓ Abi
fr: ❓ Aide
pl: <b>Pomoc</b>
ru: ❓ Помощь<b>Помощь</b>
tr: ❓ Yardım
zh_cn: ❓ 帮助

# Worker.HelpAddWord
source: /addword - add a new word
de: /addword - fügen Sie ein neues Wort hinzu
et: /addword - lisa uus sõna
fr: /addword - ajouter un nouveau mot
pl: /addword - dodaj nowe słowo
ru: /addword - добавить новое слово
tr: /addword - yeni bir kelime ekle
zh_cn: /addword - 添加一个新单词

# Worker.HelpMyWords
source: /mywords - show all words
de: /mywords - zeigen Sie alle Wörter an
et: /mywords - kuva kõik sõnad
fr: /mywords - afficher tous les mots
pl: /mywords - pokaż wszystkie słowa
ru: /mywords - показать все слова
tr: /mywords - tüm kelimeleri göster
zh_cn: /mywords - 显示所有单词

# Worker.HelpLearn
source: /learn - start learning
de: /learn - beginnen Sie mit dem Lernen
et: /learn - alusta õppimist
fr: /learn - commencer à apprendre
pl: /learn - rozpocznij naukę
ru: /learn - начать обучение
tr: /learn - öğrenmeye başla
zh_cn: /learn - 开始学习

# Worker.HelpUseMenu
source: Use the bot menu for other actions.
de: Verwenden Sie das Bot-Menü für andere Aktionen.
et: Kasutage muude toimingute jaoks boti menüüd.
fr: Utilisez le menu du bot pour d'autres actions.
pl: Użyj menu bota do pozostałych działań.
ru: Используйте меню бота для остальных действий.
tr: Diğer eylemler için bot menüsünü kullanın.
zh_cn: 使用机器人菜单进行其他操作。

# TelegramMessageHelper.WordCardExample
source: 📘 Example: {0}
de: \n\n📘 Beispiel: {0}
et: \n\n📘 Näide: {0}
fr: \n\n📘 Exemple : {0}
pl: 📘 Przykład: {0}
ru: 📘 Пример: {0}
tr: \n\n📘 Örnek: {0}
zh_cn: 📘 示例: {0}

# TelegramMessageHelper.WordCardCategory
source: 🔖 Category: {0}
de: \n🔖 Kategorie: {0}
et: \n🔖 Kategooria: {0}
fr: \n🔖 Catégorie : {0}
pl: 🔖 Kategoria: {0}
ru: 🔖 Категория: {0}
tr: \n🔖 Kategori: {0}
zh_cn: 🔖 类别: {0}

# TelegramMessageHelper.EditButton
source: ✏️ Edit
de: ✏️ Bearbeiten
et: ✏️ Muuda
fr: ✏️ Modifier
pl: ✏️ Edytuj
ru: ✏️ Редактировать
tr: ✏️ Düzenle
zh_cn: ✏️ 编辑

# TelegramMessageHelper.DeleteButton
source: 🗑 Delete
de: 🗑 Löschen
et: 🗑 Kustuta
fr: 🗑 Supprimer
pl: 🗑 Usuń
ru: 🗑 Удалить
tr: 🗑 Sil
zh_cn: 🗑 删除

# TelegramMessageHelper.RepeatButton
source: 🔁 Repeat
de: 🔁 Wiederholen
et: 🔁 Korda
fr: 🔁 Répéter
pl: 🔁 Powtórz
ru: 🔁 Повторить
tr: 🔁 Tekrarla
zh_cn: 🔁 重复

# TelegramMessageHelper.LearnedButton
source: ✅ Learned
de: ✅ Gelernt
et: ✅ Õpitud
fr: ✅ Appris
pl: ✅ Nauczone
ru: ✅ Выучено
tr: ✅ Öğrenildi
zh_cn: ✅ 已学习

# TelegramMessageHelper.EditButtonAlternative
source: ✏️ Change
de: ✏️ Ändern
et: ✏️ Muuda
fr: ✏️ Changer
pl: ✏️ Zmień
ru: ✏️ Изменить
tr: ✏️ Değiştir
zh_cn: ✏️ 更改

# TelegramMessageHelper.BackButton
source: ⬅️ Back
de: ⬅️ Zurück
et: ⬅️ Tagasi
fr: ⬅️ Retour
pl: ⬅️ Wstecz
ru: ⬅️ Назад
tr: ⬅️ Geri
zh_cn: ⬅️ 返回

# TelegramMessageHelper.ForwardButton
source: ➡️ Forward
de: ➡️ Vorwärts
et: ➡️ Edasi
fr: ➡️ Suivant
pl: ➡️ Dalej
ru: ➡️ Вперед
tr: ➡️ İleri
zh_cn: ➡️ 前进

# TelegramMessageHelper.ConfirmYesButton
source: ✅ Yes
de: ✅ Ja
et: ✅ Jah
fr: ✅ Oui
pl: ✅ Tak
ru: ✅ Да
tr: ✅ Evet
zh_cn: ✅ 是

# TelegramMessageHelper.ConfirmNoButton
source: ❌ No
de: ❌ Nein
et: ❌ Ei
fr: ❌ Non
pl: ❌ Nie
ru: ❌ Нет
tr: ❌ Hayır
zh_cn: ❌ 否

# Keyboard.MainMenu.MyWords
source: 📚 My words
de: 📚 Meine Wörter
et: 📚 Minu sõnad
fr: 📚 Mes mots
pl: 📚 Moje słowa
ru: 📚 Мои слова
tr: 📚 Kelimelerim
zh_cn: 📚 我的单词

# Keyboard.MainMenu.AddWord
source: ➕ Add word
de: ➕ Wort hinzufügen
et: ➕ Lisa sõna
fr: ➕ Ajouter un mot
pl: ➕ Dodaj słowo
ru: ➕ Добавить слово
tr: ➕ Kelime ekle
zh_cn: ➕ 添加单词

# Keyboard.MainMenu.Statistics
source: 📊 Statistics
de: 📊 Statistik
et: 📊 Statistika
fr: 📊 Statistiques
pl: 📊 Statystyki
ru: 📊 Статистика
tr: 📊 İstatistikler
zh_cn: 📊 统计

# Keyboard.MainMenu.Learn
source: 📖 Learn
de: 📖 Lernen
et: 📖 Õpi
fr: 📖 Apprendre
pl: 📖 Ucz się
ru: 📖 Учить
tr: 📖 Öğren
zh_cn: 📖 学习

# Keyboard.MainMenu.Settings
source: 🌐 Settings
de: 🌐 Einstellungen
et: 🌐 Seaded
fr: 🌐 Paramètres
pl: 🌐 Ustawienia
ru: 🌐 Настройки
tr: 🌐 Ayarlar
zh_cn: 🌐 设置

# Keyboard.MainMenu.Profile
source: 👤 Profile
de: 👤 Profil
et: 👤 Profiil
fr: 👤 Profil
pl: 👤 Profil
ru: 👤 Профиль
tr: 👤 Profil
zh_cn: 👤 个人资料

# Keyboard.MyWordsMenu.ShowAllWords
source: 🔍 Show all words
de: 🔍 Alle Wörter anzeigen
et: 🔍 Kuva kõik sõnad
fr: 🔍 Afficher tous les mots
pl: 🔍 Pokaż wszystkie słowa
ru: 🔍 Показать все слова
tr: 🔍 Tüm kelimeleri göster
zh_cn: 🔍 显示所有单词

# Keyboard.MyWordsMenu.DictionariesByTopics
source: 📁 Dictionaries by topics
de: 📁 Wörterbücher nach Themen
et: 📁 Sõnastikud teemade kaupa
fr: 📁 Dictionnaires par thèmes
pl: 📁 Słowniki według tematu
ru: 📁 Словари по темам
tr: 📁 Konulara göre sözlükler
zh_cn: 📁 按主题分类的词典

# Keyboard.MyWordsMenu.GenerateNewWords
source: Generate new words
de: Neue Wörter generieren
et: Genereeri uusi sõnu
fr: Générer de nouveaux mots
pl: Generuj nowe słowa
ru: Генерация новых слов
tr: Yeni kelimeler üret
zh_cn: 生成新词

# Keyboard.MyWordsMenu.EditWord
source: 📝 Edit word
de: 📝 Wort bearbeiten
et: 📝 Muuda sõna
fr: 📝 Modifier le mot
pl: 📝 Edytuj słowo
ru: 📝 Изменить слово
tr: 📝 Kelimeyi düzenle
zh_cn: 📝 编辑单词

# Keyboard.MyWordsMenu.DeleteWords
source: 🗑️ Delete words
de: 🗑️ Wörter löschen
et: 🗑️ Kustuta sõnad
fr: 🗑️ Supprimer les mots
pl: 🗑️ Usuń słowa
ru: 🗑️ Удалить слова
tr: 🗑️ Kelimeleri sil
zh_cn: 🗑️ 删除单词

# Keyboard.MyWordsMenu.Back
source: ⬅️ Back
de: ⬅️ Zurück
et: ⬅️ Tagasi
fr: ⬅️ Retour
pl: ⬅️ Wstecz
ru: ⬅️ Назад
tr: ⬅️ Geri
zh_cn: ⬅️ 返回

# Keyboard.WordCard.Delete
source: 🗑 Delete
de: 🗑 Löschen
et: 🗑 Kustuta
fr: 🗑 Supprimer
pl: 🗑 Usuń
ru: 🗑 Удалить
tr: 🗑 Sil
zh_cn: 🗑 删除

# Keyboard.WordCard.Repeat
source: 🔁 Repeat
de: 🔁 Wiederholen
et: 🔁 Korda
fr: 🔁 Répéter
pl: 🔁 Powtórz
ru: 🔁 Повторить
tr: 🔁 Tekrarla
zh_cn: 🔁 重复

# Keyboard.WordCard.Favorite
source: ⭐ Add to favorites
de: ⭐ Zu Favoriten hinzufügen
et: ⭐ Lisa lemmikutesse
fr: ⭐ Ajouter aux favoris
pl: ⭐ Do ulubionych
ru: ⭐ В избранное
tr: ⭐ Favorilere ekle
zh_cn: ⭐ 添加到收藏夹

# Keyboard.Config.SwitchLanguage
source: 🌐 Select study language
de: 🌐 Lernsprache auswählen
et: 🌐 Valige õppekeel
fr: 🌐 Sélectionner la langue d'étude
pl: 🌐 Wybierz język nauki
ru: 🌐 Выбрать язык изучения
tr: 🌐 Çalışma dilini seçin
zh_cn: 🌐 选择学习语言

# Keyboard.Config.AddLanguage
source: ➕ Add language
de: ➕ Sprache hinzufügen
et: ➕ Lisa keel
fr: ➕ Ajouter une langue
pl: ➕ Dodaj język
ru: ➕ Добавить язык
tr: ➕ Dil ekle
zh_cn: ➕ 添加语言

# Keyboard.Config.RemoveLanguage
source: 🔿️ Remove language
de: 🔿️ Sprache entfernen
et: 🔿️ Eemalda keel
fr: 🔿️ Supprimer la langue
pl: 🔿️ Usuń język
ru: 🔿️ Удалить язык
tr: 🔿️ Dili kaldır
zh_cn: 🔿️ 删除语言

# Keyboard.Config.NativeLanguage
source: 🌐 Native language
de: 🌐 Muttersprache
et: 🌐 Emakeel
fr: 🌐 Langue maternelle
pl: 🌐 Język ojczysty
ru: 🌐 Родной язык
tr: 🌐 Ana dil
zh_cn: 🌐 母语

# Keyboard.Config.LearningMode
source: 🎓 Learning mode
de: 🎓 Lernmodus
et: 🎓 Õpperežiim
fr: 🎓 Mode d'apprentissage
pl: 🎓 Tryb nauki
ru: 🎓 Режим обучения
tr: 🎓 Öğrenme modu
zh_cn: 🎓 学习模式

# Keyboard.Config.Help
source: ❓ Help
de: ❓ Hilfe
et: ❓ Abi
fr: ❓ Aide
pl: ❓ Pomoc
ru: ❓ Помощь
tr: ❓ Yardım
zh_cn: ❓ 帮助

# Keyboard.LearnConfig.BinaryChoice
source: Remembered/Forgot
de: Erinnert/Vergessen
et: Mäletan/Ei mäleta
fr: Rappelé/Oublié
pl: Zapamiętałem/Nie pamiętam
ru: Вспомнил/Не вспомнил
tr: Hatırladım/Unuttum
zh_cn: 记住了/忘记了

# Keyboard.LearnConfig.MultipleChoice
source: Multiple choice
et: Valikvastustega
fr: Choix multiple
pl: Wybór z listy
ru: Выбор из вариантов
tr: Çoktan seçmeli
zh_cn: 多项选择

# Keyboard.LearnConfig.BinaryChoiceSelected
source: ✅ Remembered/Forgot
de: ✅ Erinnert/Vergessen
et: ✅ Mäletan/Ei mäleta
fr: ✅ Rappelé/Oublié
pl: ✅ Zapamiętałem/Nie pamiętam
ru: ✅ Вспомнил/Не вспомнил
tr: ✅ Hatırladım/Unuttum
zh_cn: ✅ 记住了/忘记了

# Keyboard.LearnConfig.MultipleChoiceSelected
source: ✅ Multiple choice
et: ✅ Valikvastustega
fr: ✅ Choix multiple
pl: ✅ Wybór z listy
ru: ✅ Выбор из вариантов
tr: ✅ Çoktan seçmeli
zh_cn: ✅ 多项选择

# Keyboard.Statistics.Today
source: 📅 For today
de: 📅 Für heute
et: 📅 Tänaseks
fr: 📅 Pour aujourd'hui
pl: 📅 Dzisiaj
ru: 📅 За сегодня
tr: 📅 Bugün için
zh_cn: 📅 今天

# Keyboard.Statistics.TotalProgress
source: 📈 Overall progress
de: 📈 Gesamtfortschritt
et: 📈 Üldine edusamm
fr: 📈 Progression globale
pl: 📈 Całkowity postęp
ru: 📈 Общий прогресс
tr: 📈 Genel ilerleme
zh_cn: 📈 总体进度
